package main.java.section01.polymophism;

public class App {
    public static void main(String[] args) {

        /*
        * 다형성
        * 다형성이란 하나의 인스턴스가 여러 가지 타입을 가질 수 있는 것을 의미
        * 그렇기 때문에 하나의 타입으로 여러 타입의 인스턴스를 처리할 수 있다
        * 하나의 메소드 호출로 객체별로 각기 다른 방법으로 동작하게 할 수도 있다
        * 다형성은 객체지향 프로그래밍 3대 특징 캡슐화 상속 다형성 중 하나이며
        * 객체지향 프로그래밍의 꽃이라고 불릴정도로
        * 활용성이 높고 장점이 많다 하지만 학습하기 어렵다는 단점을 가지고있음
        *
        * 장점
        * 1. 여러 타입의 객체를 하나의 타입으로 관리할수있다
        * 유지보수성과 생산성이 증가
        * 2. 상속을 기반으로 한 기술이기 때문에 상속관계에 있는 모든 객체는 동일한 메세지를 수신할 수 있다
        * 이런 동일한 메세지를 수신 받아 처리하는 내용을 객체별로 다르게 할 수 있다는 장점을 가지고있음
        * 하나의 호출로여러가지 동작을 수행할 수 있다는 측면에서 오버로딩을 다형성으로 보기도 한다
        * 3. 확장성이 좋은 코드를 작성할 수 있다
        * 4.결합도를 낮춰서 유지보수성을 증가시킬 수 있다.
        *
        * */
    }
}
